In [25]:
import pandas as pd

In [26]:
my_series = pd.Series([1, 6, -2, 3, -2, 0])

In [27]:
my_series

0    1
1    6
2   -2
3    3
4   -2
5    0
dtype: int64

In [28]:
my_series[1]

6

In [29]:
my_series[1:3]

1    6
2   -2
dtype: int64

In [30]:
my_series[my_series > 0]

0    1
1    6
3    3
dtype: int64

In [31]:
my_series * 3

0     3
1    18
2    -6
3     9
4    -6
5     0
dtype: int64

In [32]:
import numpy as np

In [33]:
np.exp(my_series)

0      2.718282
1    403.428793
2      0.135335
3     20.085537
4      0.135335
5      1.000000
dtype: float64

In [34]:
np.sum(my_series)

6

In [35]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'], 
    'age': [25, 8, 48], 
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
}, index=['one', 'two', 'three'])

In [36]:
df

         name  age          job  salary
one      Маша   25  Программист     100
two      Вася    8     Школьник      10
three  Эдуард   48     Big Boss     200

In [37]:
name = df['name']
name

one        Маша
two        Вася
three    Эдуард
Name: name, dtype: object

In [38]:
df[df['salary'] >= 100]

         name  age          job  salary
one      Маша   25  Программист     100
three  Эдуард   48     Big Boss     200

In [39]:
df['salary'] *= 10
df

         name  age          job  salary
one      Маша   25  Программист    1000
two      Вася    8     Школьник     100
three  Эдуард   48     Big Boss    2000

In [40]:
df['salary'] / 2

one       500.0
two        50.0
three    1000.0
Name: salary, dtype: float64

In [45]:
df.loc['two':'three']

         name  age       job  salary
two      Вася    8  Школьник     100
three  Эдуард   48  Big Boss    2000

In [51]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary         100
Name: two, dtype: object

In [52]:
df.T

                one       two     three
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big Boss
salary         1000       100      2000